Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །དད་པ་སྐྱེས་པའི་ཤེས་པ་དང་། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་།
en: “They also have the knowledge of trusting and respecting the thus-gone ones, As well as the knowledge related to inspired accomplishment

source: །མོས་ཤིང་གུས་པའི་ཤེས་པ་དང་། །འདོད་ཆགས་སྤངས་པའི་ཆོས་དག་ལ།
en: Of the Dharma that leads to the abandonment of desire,

source: །རབ་མོས་བསྒྲུབ་པའི་ཤེས་པ་དང་། །འཕགས་པའི་དགེ་འདུན་ཚོགས་ལ་ཡང་།
en: And the knowledge of inspired worship of the noble Saṅgha.

source: །མཆོད་པར་མོས་པའི་ཤེས་པ་དང་། །བྱང་ཆུབ་ཆེན་པོ་དག་ལ་ཡང་།
en: “Likewise, they have the knowledge of devoted dedication to great awakening,

source: །རབ་མོས་བསྔོ་བའི་ཤེས་པ་དང་། །གཟུངས་རྣམས་ཀྱི་ནི་སྒོ་དག་ལ།
en: The knowledge related to the devoted revelation of the dhāraṇī gateways,

source: །རབ་མོས་སྟོན་པའི་ཤེས་པ་དང་། །མོས་པ་རྣམས་ནི་གང་ཡིན་པ།
en: The knowledge that discerns the different inclinations,

source: །སོ་སོར་རབ་རྟོགས་ཤེས་པ་དང་། །འཕགས་པའི་ཏིང་འཛིན་གང་ཡིན་པ།
en: The knowledge that realizes the noble absorptions, “The knowledge that induces certainty

source: །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་དང་། །བསྲུང་དང་རྗེས་སུ་དྲན་རྣམས་ལ།
en: About that which is to be guarded and recollected,

source: །ངེས་པར་བྱེད་པའི་ཤེས་པ་དང་། །དཔག་ཏུ་མེད་པའི་སེམས་དག་ལ།
en: The knowledge that penetrates boundless minds,

source: །ལེགས་པར་འཇུག་པའི་ཤེས་པ་དང་། །ཚིགས་སུ་བཅད་པ་ཚད་མེད་རྣམས།
en: The knowledge related to teaching in countless verses,

source: །ཡང་དག་སྟོན་པའི་ཤེས་པ་དང་། །འདོད་པའི་མཚམས་སྦྱོར་གང་ཡིན་པ།
en: “The knowledge of understanding and realizing the connection of desire,

source: །རྟོགས་ཤིང་གོ་བའི་ཤེས་པ་དང་། །འགྲོ་བ་དམན་པ་དེ་དག་ཏུ།
en: The knowledge that prevents one from falling into inferior destinies,

source: །ལྟུང་བར་མི་འགྱུར་ཤེས་པ་དང་། །མི་དགེ་བཤེས་གཉེན་གང་ཡིན་པ།
en: The knowledge that causes one to abandon nonvirtuous friends,

source: །ཡོངས་སུ་སྤོང་བྱེད་ཤེས་པ་དང་། །དགེ་བའི་བཤེས་གཉེན་གང་ཡིན་པ།
en: The knowledge that causes one to attend to virtuous friends,

source: །སྟེན་པར་བྱེད་པའི་ཤེས་པ་དང་། །འདྲི་ཞིང་ལན་ལྡོན་གང་ཡིན་པ།
en: “The knowledge that analyzes questions and answers,

source: །རབ་ཏུ་རྣམ་འབྱེད་ཤེས་པ་དང་། །གནས་དང་གནས་མིན་གང་ཡིན་པ།
en: The knowledge that realizes what is possible and what is not,

source: །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་དང་། །ས་དང་ས་མིན་གང་ཡིན་པ།
en: The knowledge that realizes what is the subject and what is not,

source: །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་དང་། །རབ་འབྲིང་ཐ་མ་གང་ཡིན་པ།
en: The knowledge that distinguishes what is superior, intermediate, and inferior, “The knowledge of the conditioned and the unconditioned,

source: །རྣམ་པར་འབྱེད་པའི་ཤེས་པ་དང་། །འདུས་བྱས་ཤེས་པ་གང་ཡིན་དང་། །འདུས་མ་བྱས་ཀྱི་ཤེས་པ་དང་། །དངོས་པོ་དང་ནི་རྫས་ཀྱི་ཤེས།
en: The knowledge of what is material and substantial and what is not, The knowledge of what is abridged and what is not, The knowledge of accomplishment and non-accomplishment,

source: །དངོས་དང་རྫས་མིན་ཤེས་པ་དང་། །ཡོངས་སུ་སྡུད་བྱེད་ཤེས་པ་དང་། །ཡོངས་སུ་སྡུད་མིན་ཤེས་པ་དང་། །མངོན་པར་སྒྲུབ་པའི་ཤེས་པ་དང་། །ཡང་དག་སྒྲུབ་མིན་ཤེས་པ་དང་། །མིག་དང་མིག་མིན་ཤེས་པ་དང་། །མིག་དང་ལྷན་ཅིག་ཤེས་པ་དང་། །མིག་གི་བྱེ་བྲག་ཤེས་པ་དང་། །མིག་གི་རང་བཞིན་ཤེས་པ་དང་། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན།
en: “The knowledge of the eye and the non-eye, The knowledge of what is simultaneously present with the eye, The knowledge of the particularities of the eye, And the knowledge of the nature of the eye. “The same should be applied To all the twenty-five phenomena—

source: །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི།
en: From the ear, the nose, the tongue, and the body

source: །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: “Those who contemplate the fact

source: །གང་ཞིག་མིག་གི་རྒྱུ་རྐྱེན་ཉིད།
en: That the causes and conditions of the eye

source: །ཡང་དག་སྟོང་ཞིང་དབེན་པ་དང་། །མཐར་ནི་བདག་ཡོད་མ་ཡིན་པར། །སེམས་པར་བྱེད་པ་གང་ཡིན་པ། །གང་ཟག་དེས་ནི་དེ་བཞིན་དུ།
en: Are ultimately empty, void, and devoid of self

source: །ཡང་དག་ངེས་པ་ཁོ་ནར་ནི། །སེམས་ཀྱི་ཏིང་འཛིན་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར།
en: Will, accordingly, perfect genuine mental absorption without a doubt. “The persons who realize with certainty and contemplate

source: །གང་ཞིག་མིག་གི་རྟེན་འབྲེལ་དང་། །མིག་མི་རྟག་པའི་མཚན་ཉིད་དག །ངེས་པ་ཉིད་དུ་རྟོགས་གྱུར་ནས། །སེམས་པར་བྱེད་པ་གང་ཡིན་པ།
en: The eye’s dependent origination and impermanent character

source: །མིག་གི་རྒྱུ་རྐྱེན་གང་ཡིན་དང་། །མཐར་ནི་ཡོད་པ་མ་ཡིན་པ།
en: That the causes and conditions of the eye are ultimately nonexistent.

source: །ཡང་དག་ཇི་བཞིན་རྟོགས་པར་འགྱུར།
en: “The same should be applied To all the twenty-five phenomena—

source: །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: Up to words and names.” Here, I have summarized the amazing displays that were manifested,

source: །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ཞབས་ནི་ས་ལ་རེག་ཙམ་གྱིས། །དངོས་པོ་ངོ་མཚར་རབ་བསྟན་པ།
en: By the mere fact of his feet touching the ground, When the Blessed One came to the city.

source: །དེང་འདིར་བདག་གི་མདོར་བསྡུས་ནས། །ཡོན་ཏན་ཕྱོགས་ནི་ཅུང་ཟད་ཅིག །སེམས་ཅན་དགའ་བ་བསྐྱེད་པའི་ཕྱིར། །ཡང་དག་པར་ནི་བསྟན་པར་བྱ།
en: To please beings, I will now teach a bit about his qualities.

source: །དེ་ཚེ་ལྷ་མི་འདྲེན་པ་ཡིས། །སྤུ་ཡི་ཁུང་བུ་གཅིག་ནས་ནི། །འོད་ཟེར་བརྒྱ་སྟོང་ཚད་མེད་སྙེད། །རབ་ཏུ་བཀྱེ་བར་གྱུར་པས་ན།
en: At that moment, countless hundreds of thousands of light rays Radiated from each pore of the guide of gods and humans.

source: །འོད་ཟེར་དག་ནི་རེ་རེས་ཀྱང་། །ཞིང་ནི་ཚད་མེད་གསལ་མཛད་ནས།
en: Each of those light rays illuminated countless realms

source: །སེམས་ཅན་མང་པོ་ཀུན་གྱི་ཕྱིར། །སངས་རྒྱས་མཛད་པ་རབ་ཏུ་མཛད།
en: And performed awakened activity for the sake of numerous beings.

source: །གང་ཞིག་འདས་པའི་དུས་སུ་ནི།
en: If those who have worshiped buddhas in the past

source: །སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་དང་། །ཡུན་རིང་སྦྱིན་དང་ཚུལ་ཁྲིམས་དག །མངོན་པར་བསྒྲུབས་པ་གང་ཡིན་པ། །དེ་ལྟ་བུ་ཡི་གང་ཟག་དག །དེས་ནི་ཇི་སྐད་བསྟན་པ་ཡི།
en: And practiced generosity and discipline for a long time

source: །རྫུ་འཕྲུལ་དངོས་པོ་ཐོས་གྱུར་ན།
en: Hear about the miraculous displays that were described,

source: །རབ་ཏུ་དགའ་ཞིང་མོས་པར་འགྱུར།
en: They will be overjoyed and filled with devotion.

source: །གང་ཞིག་སངས་རྒྱས་རྫུ་འཕྲུལ་རྣམས།
en: If those persons who know that the Buddha’s miraculous powers

source: །ཉན་ཐོས་དང་ནི་རང་རྒྱལ་གྱི། །སྤྱོད་ཡུལ་མིན་པར་རབ་ཤེས་ནས། །དེ་ལྟ་བུ་ཡི་གང་ཟག་དག །དེས་ནི་ཇི་སྐད་བསྟན་པ་ཡི།
en: Are not the domain of the hearers and the solitary buddhas

source: །རྫུ་འཕྲུལ་དག་ནི་ཐོས་གྱུར་ན།
en: Hear about the miraculous displays that were described,

source: །མོས་པ་དག་ནི་སྐྱེ་འགྱུར་ཞིང་། །ངོ་མཚར་འཛིན་པའི་སེམས་ཀྱང་སྐྱེད།
en: They will be filled with devotion and amazement.

source: །ལྷ་དང་མི་ནི་འདྲེན་པ་ཡིས།
en: Since the guide of gods and humans manifested

source: །བསམ་གྱིས་མི་ཁྱབ་མཐུ་དག་གིས། །དེ་ལྟ་བུ་ལ་སོགས་པ་ཡི། །རྫུ་འཕྲུལ་སྣ་ཚོགས་རབ་བསྟན་པས།
en: Such a variety of miraculous displays through his inconceivable powers,

source: །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་དང་། །ཚད་མེད་གྲངས་མེད་པ་རྣམས་ཀྱིས། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ནི།
en: Countless hundreds of thousands of sentient beings

source: །བསྟེན་ཅིང་རིམ་གྲོ་མཆོད་པ་བྱས།
en: Attended to, revered, and worshiped the Thus-Gone One.

source: །བསམ་གྱིས་མི་ཁྱབ་མཐུ་དག་གིས། །མདོ་སྡེ་དག་ནི་བརྒྱ་སྟོང་དང་། །ཚད་མེད་གྲངས་མེད་རབ་བཤད་པས།
en: Countless hundreds of thousands of discourses through his inconceivable powers,

source: །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །བསྟན་པ་དེ་ནི་ཐོས་པས་ན། །ཐམས་ཅད་དང་བས་རབ་བླངས་ཏེ། །སེམས་ནི་རབ་ཏུ་དགའ་བར་གྱུར།
en: Many sentient beings, upon hearing them, Faithfully adopted all those teachings and were overjoyed.

source: །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས།
en: At that time,

source: །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །རྫུ་འཕྲུལ་གྱི་ནི་མཐུ་དག་གིས།
en: When the Blessed One came to the city,

source: །ནམ་མཁའ་ལས་ནི་འདི་སྐད་དུ།
en: These words resounded in the sky Through the strength of his miraculous powers:

source: །མིག་ཟད་མཐའ་ནི་ཤེས་པ་ནས།
en: “By knowing the limit of the exhaustion of the eye

source: །ལྷ་མིག་ནི་ཉེ་བར་ཞི་བ་དང་། །མིག་ཉིད་རྒྱུ་ཡི་བར་དུ་ཡང་།
en: Up to its peace and its causes,

source: །འགྲོ་བ་མེད་ཅིང་འོང་མེད་དང་། །མཐར་ནི་སྟོང་དབེན་ཤེས་པར་གྱིས།
en: Everything is beyond coming and going— Ultimately empty and void.

source: །དེ་སྐད་དུ་ནི་ཐོས་པར་གྱུར།
en: “The same should be applied To all the twenty-five phenomena—

source: །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི།
en: Manifested in the sky,

source: །སྒྲ་སྙན་དམ་པ་མཆོག་བྱུང་ནས།
en: Proclaiming the praises

source: །དེ་བཞིན་གཤེགས་པའི་མཚན་སྣ་ཚོགས།
en: Of the Thus-Gone One’s various names,

source: །བསྔགས་པ་བརྗོད་པར་གྱུར་པས་ན།
en: Thereby generating faith and devotion

source: །འཁོར་ནི་འདུས་པ་ཆེན་པོ་རྣམས། །ཐམས་ཅད་དད་མོས་སེམས་ཀྱང་སྐྱེས།
en: In the minds of all the members of those great assemblies:

source: །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ།
en: “The lion of human beings who resides now in the world

source: །མཚན་ནི་བདུད་དང་བདུད་དཔུང་དག །ཕམ་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Subjugates Māra and His Armies;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི།
en: It is said that all who hear that name

source: །ལོག་པར་ལྟ་བའི་ཚོགས་ཐམས་ཅད། །རབ་ཏུ་འདུལ་བར་ནུས་ཤེས་ཟེར།
en: Will be able to overcome all wrong views.

source: །མཚན་ནི་འདོད་ཆགས་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Desire;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་བ་དེ་དག་ནི།
en: Those who hear that name

source: །འདོད་པའི་འདོད་ཆགས་གང་ཡིན་པ། །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར།
en: Will abandon all their desires.

source: །མཚན་ནི་ཞེ་སྡང་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Anger;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཞེ་སྡང་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར།
en: Will abandon all their anger.

source: །མཚན་ནི་གཏི་མུག་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Ignorance;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །གཏི་མུག་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་ང་རྒྱལ་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Pride;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ང་རྒྱལ་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་ཁོང་ཁྲོ་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Aggression;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཁོང་ཁྲོ་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་ཕྲག་དོག་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Jealousy;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཕྲག་དོག་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་མི་བདེན་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Falsity;

source: །མི་བདེན་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར།
en: Will abandon all that is false.

source: །མཚན་ནི་ལྟ་རྣམས་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Views;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ལྟ་བ་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་སྤྲོས་པ་གཞོམ་པ་དང་། །ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Conquers and Pacifies Concepts;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །སྤྲོས་པ་དག་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །མཚན་ནི་ཡང་དག་པ་ཡི་ཆོས། །རྣམ་དག་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named King of the Genuine and Pure Dharma;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །རྣམ་དག་ཆོས་ནི་གང་ཡིན་པ།
en: Those who hear that name

source: །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will realize the pure Dharma.

source: །མཚན་ནི་ལས་རྣམས་རྟོགས་པ་ཡི། །ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ་བ་ཡིན།
en: Is named Dharma King Who Understands Actions;

source: །ལས་རྣམས་ཐམས་ཅད་གང་ཡིན་པ། །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will completely understand all actions.

source: །མཚན་ནི་རྫུ་འཕྲུལ་ཕུན་ཚོགས་པའི། །ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ་བ་ཡིན།
en: Is named Dharma King Endowed with Excellent Miraculous Powers;

source: །རྫུ་འཕྲུལ་ཡོན་ཏན་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will perfect the qualities of the miraculous powers.

source: །མཚན་ནི་ཕ་རོལ་ཕྱིན་པ་རྣམས། །ཕུན་ཚོགས་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Endowed with the Excellent Perfections;

source: །ཕ་རོལ་ཕྱིན་དྲུག་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will master the six perfections.

source: །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་འདུ་བྱེད་གང་ཡིན་པ།
en: “The lion of human beings who resides now in the world

source: །རབ་རྟོགས་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ།
en: Is named Dharma King Who Completely Understands Formations;

source: །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །འཛིན་པར་བྱེད་པ་དེ་དག་ནི།
en: Those who remember that name

source: །འདུ་བྱེད་དག་ནི་ཐམས་ཅད་ཀུན། །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will completely understand all formations.

source: །མཚན་ནི་རྣམ་པར་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་སྐྱེད་ཅེས་བྱ།
en: Is named Holder and Propagator of Immaculate Light;

source: །ཁྱད་པར་འཕགས་པའི་སྐྱེ་ལེན་དག །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will perfect noble rebirths.

source: །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཁ་དོག་དག་པ་ཡི།
en: “The lion of human beings who resides now in the world

source: །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ།
en: Is also named Holder of Pristine Bright Light;

source: །ཁྱད་པར་འཕགས་པའི་གཟུགས་དམ་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will perfect the most sublime and excellent physical appearance.

source: །མཚན་ནི་སྐུ་ཉིད་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ།
en: Is also named Holder of the Light of Pure Bodies;

source: །ཁྱད་པར་འཕགས་པའི་གཟུགས་སྐུ་དག །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will perfect noble bodies.

source: །མཚན་ནི་གདུང་ཉིད་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ།
en: Is also named Holder of the Light of Pure Lineage;

source: །ཁྱད་པར་འཕགས་པའི་རུས་རིགས་རྣམས། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will achieve eminent family lineages.

source: །མཚན་ནི་རྒྱ་ཆེར་གྲགས་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ།
en: Is also named Holder of the Light of Widespread Fame;

source: །རྒྱ་ཆེར་གྲགས་པའི་གྲགས་པ་རྣམས། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: Will achieve widespread renown.

source: །མཚན་ནི་སྦྱིན་པ་གཏོང་བ་དང་། །ཚུལ་ཁྲིམས་ཅན་དང་བཟོད་བསྒོམས་དང་། །བརྩོན་འགྲུས་བརྩམས་དང་བསམ་གཏན་དང་། །ཤེས་རབ་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ།
en: Is also named Holder of Generosity, Discipline, Patience, Diligence, Concentration, and Insight;

source: །སྦྱིན་པ་དང་ནི་ཚུལ་ཁྲིམས་ནས།
en: From generosity and discipline Up to insight—

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་པ་དང་། །གཟུངས་ཀྱི་སྒོ་ནི་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར།
en: As well as the dhāraṇī gateways.

source: །མཚན་ནི་སྟོང་ཉིད་རྫོགས་པ་ཡི། །ཆོས་ཀྱི་རྗེ་ཞེས་བྱ་བ་ཡིན།
en: Is named Dharma Lord of Complete Emptiness;

source: །ཆོས་རྣམས་སྟོང་པའི་དོན་དག་ཀྱང་། །ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར།
en: Will teach others the meaning of the emptiness of phenomena.

source: །མཚན་ནི་བདག་མེད་རྫོགས་པ་ཡི། །ཆོས་ཀྱི་རྗེ་ཞེས་བྱ་བ་ཡིན།
en: Is named Dharma Lord of Complete Selflessness;

source: །སྐྱེ་འགག་མེད་དོན་གང་ཡིན་པ། །ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར།
en: Will teach others the meaning of the absence of arising and cessation.

source: །མཚན་ནི་སྤྱན་ཉིད་དག་པ་ཡི། །ཀུན་འཛིན་ཆོས་ཀྱི་རྗེ་ཞེས་བྱ།
en: Is named Dharma Lord Endowed with Pure Vision;

source: །མིག་ཟད་མཐའ་དོན་གང་ཡིན་པ། །ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར།
en: Will teach others the meaning of the limit of the exhaustion of the eye. “The same should be applied to all the twenty-five phenomena—

source: །ཆོས་ནི་ཉི་ཤུ་རྩ་ལྔ་དང་། །མེ་ཏོག་ཕྲེང་བ་སྤོས་དག་དང་། །མར་མེ་གདུགས་དང་གོས་རྣམས་ཀྱང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།། །།བམ་པོ་ལྔ་པ་སྟེ་ཐ་མ།།
en: As well as to flower garlands, perfumes, lamps, parasols, and fabrics.”

source: དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ།
en: At that time, when the Blessed One came to the city,

source: །བསམ་གྱིས་མི་ཁྱབ་པ་དག་ནི། །རྫུ་འཕྲུལ་གྱི་ནི་སྟོབས་རྣམས་ཀྱིས། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི།
en: Through his inconceivable miraculous powers,

source: །སྒྲ་སྙན་དམ་པ་རབ་བྱུང་སྟེ།
en: The most sublime melodious voice Manifested in the sky.

source: །གཟུངས་ཀྱི་སྤྱོད་པ་སྣ་ཚོགས་དག །ཡང་དག་པར་ནི་བསྟན་པས་ན།
en: As it revealed the various Activities of the dhāraṇīs,

source: །འཁོར་ནི་འདུས་པ་ཆེན་པོ་རྣམས།
en: The great assemblies present

source: །འདི་ལྟ་བུ་ཡི་ཚིག་ཐོས་ཏེ།
en: Heard these words:

source: །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས།
en: “These dhāraṇīs cause one to realize all the ultimate modes of phenomena—

source: །མིག་གི་ཟད་མཐའ་གང་ཡིན་དང་། །སྐྱེ་མཐའ་དང་ནི་མཐའ་རྣམས་དང་། །རབ་དབེན་དང་ནི་འཇུག་པ་ནས། །ཉེ་བར་ཞི་བའི་བར་རྣམས་ཀྱི། །ཆོས་རྣམས་གང་ཡིན་དེ་དག་གིས།
en: From the limit of the exhaustion of the eye, the limit of its arising,

source: །མཐར་ཕྱིན་གནས་ནི་གང་ཡིན་པ།
en: Its limit, its disengagement, and its cognition, up to its peace.

source: །ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་བྱེད།
en: They cause one to realize that, ultimately, everything is pure—

source: །སྦྱིན་པའི་སྟོབས་ནི་གང་དག་གིས།
en: “That which is gathered through the power of generosity,

source: །མཐར་ནི་གང་དག་སྡུད་པ་དང་། །ཚུལ་ཁྲིམས་སྟོབས་ནི་གང་དག་གིས།
en: That which is accomplished through the power of discipline,

source: །མཐར་ནི་གང་དག་འགྲུབ་པ་དང་། །བཟོད་པའི་སྟོབས་ནི་གང་དག་གིས།
en: That which is established through the power of patience,

source: །མཐར་ནི་གང་དག་བཀོད་པ་དང་། །བརྩོན་འགྲུས་སྟོབས་ནི་གང་དག་གིས།
en: That which is generated through the power of diligence,

source: །མཐར་ནི་གང་དག་སློང་བ་དང་། །བསམ་གཏན་སྟོབས་ནི་གང་དག་གིས།
en: “That which is cultivated through the power of concentration,

source: །མཐར་ནི་གང་དག་སྒོམ་པ་དང་། །ཤེས་རབ་སྟོབས་ནི་གང་དག་གིས།
en: And that which is revealed through the power of insight,

source: །མཐར་ནི་གང་དག་སྟོན་པ་དང་། །ཡི་གེ་རྣམས་དང་བརྗོད་པ་དང་། །སྒྲ་སྐད་རྣམས་ནི་སྤངས་པ་ནས།
en: As well as the abandonment of words, expressions,

source: །གཟུགས་དང་སེམས་ཀྱི་བར་དུ་ཡང་།
en: And language, up to forms and mind.

source: །མཐར་ནི་རྣམ་དག་ཉིད་དུ་རྟོགས།
en: “They cause one to realize that everything defiled and undefiled,

source: །ཟག་དང་བཅས་དང་ཟག་མེད་དང་། །དོན་རྣམས་དང་ནི་ཕན་པ་དག །ཐམས་ཅད་སྟོང་ཞིང་དབེན་པ་དང་། །མཐར་ནི་རྣམ་དག་ཉིད་དུ་རྟོགས།
en: As well as all welfare and benefit, Is empty, void, And ultimately pure. “They do not cause one to abide or dwell

source: །སྲིད་པ་དག་ནི་ཐམས་ཅད་ལ།
en: In any of the realms of existence;

source: །རྟེན་ཅིང་གནས་པར་མི་བྱེད་དང་། །གཟུངས་དང་ཏིང་འཛིན་དག་ལ་ནི།
en: Instead, they cause one to abide, disengaged,

source: །རབ་ཏུ་དབེན་པར་གནས་པར་བྱེད།
en: In dhāraṇī and absorption. “Everything is beyond coming and going—

source: །འགྲོ་བ་མེད་ཅིང་འོང་མེད་དང་། །དགེ་བ་མ་ཡིན་མི་དགེ་མིན། །ལུང་དུ་མི་སྟོན་པ་ཡང་མིན།
en: Not virtuous, nonvirtuous, or neutral.

source: །བདག་དང་གཞན་ལ་ཕན་འདོགས་པའི། །དེ་ལྟ་བུ་ཡི་མཚན་མ་རྣམས། །ཐམས་ཅད་ཡོངས་སུ་དག་པས་ན། །དབང་ཕྱུག་ཡོན་ཏན་དག་ལ་ཡང་།
en: All marks, such as those that benefit Oneself and others, are pure.

source: །གནས་པར་ཡང་ནི་མི་བྱེད་དོ།
en: “Therefore, they cause one not to dwell On the qualities of a supreme being

source: །ཉན་ཐོས་དང་ནི་སྐྱེ་བོ་དང་། །སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ལ་ཡང་།
en: Or the qualities of the hearers, Ordinary beings, or the buddhas.

source: །མིག་ནི་ཟད་པའི་མཐའ་དག་དང་། །སྐྱེ་མཐའ་དང་ནི་མཐའ་རྣམས་ནས།
en: The limit of the exhaustion of the eye, The limit of its arising, and its limit,

source: །ཉེ་བར་ཞི་བའི་བར་རྣམས་ཀྱི།
en: Up to its peace.

source: །སྤྱོད་པ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་ཡོངས་སུ་ཞི་བར་བྱེད།
en: “They cause one to abandon

source: །སྐྱེ་བ་དང་ནི་མི་སྐྱེ་དང་། །སྡུག་བསྔལ་དང་ནི་བདེ་བ་དང་། །བསྟོད་པ་དང་ནི་སྨད་པ་དག །ཐམས་ཅད་ཡོངས་སུ་སྤོང་ཞེས་ཟེར། །མཐར་ཕྱིན་སྣང་བ་གང་ཡིན་དང་། །སྟོང་པའི་གཟུངས་ནི་གང་ཡིན་པ།
en: All arising, non-arising, Suffering, happiness, Praise, and criticism.

source: །ཐམས་ཅད་རབ་ཏུ་གང་རྟོགས་པ།
en: “Both the realization of all these perfect manifestations

source: །འདི་ཉིད་སངས་རྒྱས་སྤྱོད་ཡུལ་ལ།
en: And these empty dhāraṇīs

source: །རབ་ཏུ་གནས་པར་བྱེད་པ་ཡིན།
en: Cause one to dwell within

source: །འདི་ཉིད་སངས་རྒྱས་རོལ་པ་ཡི།
en: The domain of the buddhas;

source: །གནས་ལ་རབ་ཏུ་གནས་པ་ཡིན།
en: “They place one firmly within the abode of the buddhas’ display,

source: །འདི་ཉིད་སངས་རྒྱས་རྫུ་འཕྲུལ་ལ། །རབ་ཏུ་གནས་པར་གྱུར་པ་ཡིན།
en: Within the buddhas’ miraculous powers,

source: །འདི་ཉིད་སངས་རྒྱས་མཁྱེན་པ་ལ།
en: And within the buddhas’ wisdom.

source: །རབ་ཏུ་གནས་པར་གྱུར་པ་ཡིན།
en: They also cause one to dwell within the power

source: །མིག་ཟད་མཐའ་ཡི་སྟོབས་དག་ལ།
en: “Of the limit of the exhaustion of the eye,

source: །དེ་བཞིན་དུ་ནི་གནས་པ་དང་། །མིག་སྐྱེ་མཐའ་ཡི་སྟོབས་དག་ལ།
en: Within the power of the limit of the arising of the eye,

source: །དེ་བཞིན་དུ་ནི་གནས་པ་དང་། །མིག་གི་མཐའ་ཡི་སྟོབས་དག་ལ།
en: And within the power of the limit of the eye, Up to the power of its peace.

source: །དེ་བཞིན་དུ་ནི་གནས་པ་ནས།
en: “The same applies

source: །ཉེ་བར་ཞི་བའི་སྟོབས་ཀྱི་བར།
en: To all the twenty-five phenomena—

source: །དེ་ལ་རབ་ཏུ་གནས་པ་དང་། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི།
en: From the ear, the nose, the tongue, and the body

source: །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས།
en: “These dhāraṇīs cause one to perfect

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྟོབས། །ཁྱད་པར་འཕགས་པ་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེས་ཟེར། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས།
en: The exalted power of the thus-gone ones.

source: །གཟི་བྱིན་མཐུ་སྟོབས་དེ་ལྟ་བུ། །ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་ནི།
en: Once these dhāraṇīs have caused one to perfect such a magnificent power,

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི།
en: One will enter the abodes of all the thus-gone ones.

source: གནས་ཀུན་ལ་ནི་འཇུག་པ་དང་། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི། །སྤྱོད་ཡུལ་ཀུན་ལ་གནས་གྱུར་པས།
en: “By dwelling in the domain of all the thus-gone ones,

source: །འཇིག་རྟེན་པ་ནི་ཐམས་ཅད་ཀུན།
en: One will cause all worldly beings,

source: །ལྷ་མ་ཡིན་གྱི་ཚོགས་དག་ལ།
en: Such as the hosts of asuras,

source: །བརྟན་པར་འཛིན་པའི་སེམས་སྤངས་ནས། །ཚངས་པའི་སྤྱོད་ལ་གནས་པར་བྱེད།
en: To abandon their rigid clinging and observe pure conduct.

source: །གནོད་སྦྱིན་བརྒྱ་སྟོང་ཚད་མེད་དང་། །གྲུལ་བུམ་དག་ནི་ཚད་མེད་རྣམས།
en: “One will delight all the countless hundreds of thousands of yakṣas

source: །དེ་དག་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །རབ་ཏུ་དགའ་བ་སྐྱེད་པར་བྱེད། །དྲི་ཟའི་འཁོར་ནི་གང་ཡིན་དང་། །སྲིན་པོའི་འཁོར་ནི་གང་ཡིན་པ།
en: And all the countless kumbhāṇḍas;

source: །ཚད་མེད་གྲངས་མེད་དེ་དག་ཀྱང་། །རབ་ཏུ་དུལ་ལ་དགའ་བར་བྱེད།
en: One will also tame and delight all the innumerable Retinues of gandharvas and rākṣasas.

source: །གལ་ཏེ་ཚངས་པའི་འཁོར་རྣམས་ཀྱིས།
en: “Even if the retinues of Brahmā Attempted to utter their words and express their meaning

source: །སྒྲ་སྙན་དག་ནི་དམ་པ་ཡིས། །ཚིག་དང་དོན་ནི་རྗོད་བྱེད་ཀྱང་།
en: With sublime melodious voices,

source: །ཡང་དག་བསྟན་པར་མི་ནུས་ཏེ།
en: They would not be able to reveal them. “They cannot be fathomed

source: །སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས། །དཔག་པར་བྱ་བ་མ་ཡིན་དང་། །སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས།
en: Through any mental states;

source: །གཟུངས་བར་བྱ་བ་མིན་ཞེས་ཟེར།
en: They cannot be grasped

source: །གཟུངས་ནི་གང་ཡིན་འདི་དག་ནི།
en: Through any mental states.

source: །མིག་གིས་དམིགས་པར་བྱ་བ་མིན། །གཟུངས་ནི་གང་ཡིན་འདི་དག་ནི།
en: “These dhāraṇīs cannot be apprehended

source: །ལུས་ཀྱི་བར་གྱིས་དམིགས་བྱ་མིན། །གཟུངས་ནི་གང་ཡིན་འདི་དག་ནི།
en: By the eyes, or by anything up to the body;

source: །མིག་གིས་དམིགས་པར་བྱ་བ་མིན།
en: They cannot be apprehended

source: །མིག་གི་སྤྱོད་ཡུལ་བར་གྱིས་ཀྱང་།
en: By the eyes, or by anything up to the domain of the eyes.

source: །དམིགས་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: “The same applies To all the twenty-five phenomena—

source: །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ།
en: Up to words and names.

source: །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར།
en: “They cause one to understand all marks—

source: །གཞན་ཡང་མིག་གི་ཟད་མཐའ་དང་། །མིག་རྣམས་ཀྱི་ནི་སྐྱེ་མཐའ་དང་། །མིག་གི་མཐའ་དང་འཇུག་པ་ནས།
en: The fact that the limit of the exhaustion of the eye, The limit of its arising, its limit, and its cognition,

source: །ཉེ་བར་ཞི་བའི་བར་དག་ལ།
en: Up to its peace,
